{"keras_version": "1.2.0", "config": [{"config": {"gamma_regularizer": null, "input_dtype": "float32", "mode": 1, "beta_regularizer": null, "axis": -1, "momentum": 0.99, "name": "batchnormalization_1", "batch_input_shape": [null, 64, 64, 3], "epsilon": 0.001, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"W_constraint": null, "nb_col": 5, "nb_filter": 24, "subsample": [2, 2], "border_mode": "valid", "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "conv1_1", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "nb_col": 5, "nb_filter": 36, "subsample": [2, 2], "border_mode": "valid", "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "conv2_1", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "nb_col": 5, "nb_filter": 48, "subsample": [2, 2], "border_mode": "valid", "nb_row": 5, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "conv3_1", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "conv4_1", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "name": "conv4_2", "b_constraint": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 64, "W_regularizer": null, "output_dim": 1164, "activation": "linear", "activity_regularizer": null, "name": "dense_0", "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 1164, "W_regularizer": null, "output_dim": 100, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "output_dim": 50, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 50, "W_regularizer": null, "output_dim": 10, "activation": "linear", "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 10, "W_regularizer": null, "output_dim": 1, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}